issues/4.org
* Issue 4
  It is not clear whether /local nicknames/ of the package *being defined*
  should affect ~make-package~ or ~defpackage~.
** Example
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:export #:x))
    (defpackage #:b (:use) (:export #:x))
    (defpackage #:c
      (:use #:a)
      (:local-nicknames (#:a #:b) (#:b #:a)))

    (print (package-name (symbol-package 'c::x)))
    ; => "A"  (sbcl, ccl, acl, abcl, clasp)
    ;; ecl errors... :/
    #+END_SRC
** Proposal
   They should not.
** Currently
   sbcl, ccl, acl, abcl: they don't.

   ecl: they do (or not? not sure).

   clasp: they do in some weird way - also depends on order in which PLN are
   added.
