issues/4.tex
% Created 2023-06-23 Fri 18:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Grolter Bell}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Grolter Bell},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Issue 4}
\label{sec:org5f59b9e}
It is not clear whether \emph{local nicknames} of the package \textbf{being defined}
should affect \texttt{make-package} or \texttt{defpackage}.
\subsection{Example}
\label{sec:org997d9f4}
\begin{verbatim}
(defpackage #:a (:use) (:export #:x))
(defpackage #:b (:use) (:export #:x))
(defpackage #:c
  (:use #:a)
  (:local-nicknames (#:a #:b) (#:b #:a)))

(print (package-name (symbol-package 'c::x)))
; => "A"  (sbcl, ccl, acl, abcl, clasp)
;; ecl errors... :/
\end{verbatim}
\subsection{Proposal}
\label{sec:org5211d38}
They should not.
\subsection{Currently}
\label{sec:orgea91d26}
sbcl, ccl, acl, abcl: they don't.

ecl: they do (or not? not sure).

clasp: they do in some weird way - also depends on order in which PLN are
added.
\end{document}
